Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_ckcu.c
/*********************************************************************************************************//**
 * @file    ht32f175x_275x_ckcu.c
 * @version V1.0
 * @date    12/02/2010
 * @brief   This library provides all the Clock Control Unit functions.
 *************************************************************************************************************
 *
 * <h2><center>Copyright (C) 2011 Holtek inc. All rights reserved</center></h2>
 *
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f175x_275x_ckcu.h"

/** @addtogroup HT32F175x_275x_Peripheral_Driver HT32F175x/275x Peripheral Driver
  * @{
  */

/** @defgroup CKCU CKCU
  * @brief CKCU driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------------------------------------*/

/** @defgroup CKCU_Private_TypesDefinitions CKCU private types definitions
  * @{
  */

/**
  * @}
  */  /* End of CKCU_Private_TypesDefinitions group */

/* Private define ------------------------------------------------------------------------------------------*/

/** @defgroup CKCU_Private_Define CKCU private definitions
  * @{
  */

/* GCFGR bit field define                                                                                   */
#define CKCU_POS_CKOUTSRC       0
#define CKCU_MASK_CKOUTSRC      0x7

#define CKCU_POS_URPRE          20
#define CKCU_MASK_URPRE         ((u32)0x3 << CKCU_POS_URPRE)

#define CKCU_POS_USBPRE         22
#define CKCU_MASK_USBPRE        ((u32)0x3 << CKCU_POS_USBPRE)

/* GCCR bit field define                                                                                    */
#define CKCU_POS_SW             0
#define CKCU_MASK_SW            0x3

/* PLLCFGR bit field define                                                                                 */
#define CKCU_POS_POTD           21
#define CKCU_POS_PFBD           23
#define CKCU_MASK_PLLOTDV       ((u32)0x0003 << CKCU_POS_POTD)
#define CKCU_MASK_PLLFBDV       ((u32)0x003F << CKCU_POS_PFBD)

/* APBCFGR bit field define                                                                                 */
#define CKCU_POS_ADCDIV         16
#define CKCU_MASK_ADCDIV        ((u32)0x0007 << CKCU_POS_ADCDIV)

/* CKST bit field define                                                                                    */
#define CKCU_POS_PLLST          8
#define CKCU_POS_HSEST          16
#define CKCU_POS_HSIST          24
#define CKCU_MASK_PLLST         ((u32)0x000F << CKCU_POS_PLLST)
#define CKCU_MASK_HSEST         ((u32)0x0003 << CKCU_POS_HSEST)
#define CKCU_MASK_HSIST         ((u32)0x0007 << CKCU_POS_HSIST)

/* Register address define                                                                                  */
#define CKCU_ADDR_GCFGR         (u32)(CKCU_BASE + 0x00)
#define CKCU_ADDR_GCCR          (u32)(CKCU_BASE + 0x04)
#define CKCU_ADDR_GCIR          (u32)(CKCU_BASE + 0x0C)
#define CKCU_ADDR_PLLCR         (u32)(CKCU_BASE + 0x1C)
#define CKCU_ADDR_LPCR          (u32)(CKCU_BASE + 0x300)

/* Bit band alias define                                                                                    */

/* GCFGR Bit Band Alias                                                                                     */
#define CKCU_BB_WDTSRC          BitBand(CKCU_ADDR_GCFGR, 3)
#define CKCU_BB_PLLSRC          BitBand(CKCU_ADDR_GCFGR, 8)

/* GCCR Bit Band Alias                                                                                      */
#define CKCU_BB_PLLEN           BitBand(CKCU_ADDR_GCCR, 9)
#define CKCU_BB_HSEEN           BitBand(CKCU_ADDR_GCCR, 10)
#define CKCU_BB_HSIEN           BitBand(CKCU_ADDR_GCCR, 11)
#define CKCU_BB_CKMEN           BitBand(CKCU_ADDR_GCCR, 16)
#define CKCU_BB_PSRCEN          BitBand(CKCU_ADDR_GCCR, 17)

/* GCIR Bit Band Alias                                                                                      */
#define CKCU_BB_CKSF            BitBand(CKCU_ADDR_GCIR, 0)
#define CKCU_BB_CKSIE           BitBand(CKCU_ADDR_GCIR, 16)

/* PLLCR Bit Band Alias                                                                                     */
#define CKCU_BB_PLLBYPASS       BitBand(CKCU_ADDR_PLLCR, 31)

/* LPCR Bit Band Alias                                                                                      */
#define CKCU_BB_BKISO           BitBand(CKCU_ADDR_LPCR, 0)

/**
  * @}
  */  /* End of CKCU_Private_Define group */

/* Private macro -------------------------------------------------------------------------------------------*/

/** @defgroup CKCU_Private_Macro CKCU private macros
  * @{
  */

/*********************************************************************************************************//**
 * @brief This macro is used to write the bit-field of the specific register.
 * @param Reg: Bit-field in what register.
 * @param Mask: Mask of this bit-field.
 * @param Pos: First bit position of this bit-field.
 * @param WriteValue: Write value.
 * @retval None
 ************************************************************************************************************/
#define CKCU_BF_WRITE(Reg, Mask, Pos, WriteValue)    (Reg = ((Reg & ~((u32)Mask)) | ((u32)WriteValue << Pos)) )

/*********************************************************************************************************//**
 * @brief This macro is used to read the bit-field of the specific register.
 * @param Reg: Bit-field in what register.
 * @param Mask: Mask of this bit-field.
 * @param Pos: First bit position of this bit-field.
 * @retval The specific bit-field value.
 ************************************************************************************************************/
#define CKCU_BF_READ(Reg, Mask, Pos)    ((Reg & (u32)Mask ) >> Pos )

/**
  * @}
  */  /* End of CKCU_Private_Macro group */

/* Private variables ---------------------------------------------------------------------------------------*/

