Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_ckcu.c
/** @defgroup CKCU_Private_Variable CKCU private variables
  * @{
  */

/**
  * @}
  */  /* End of CKCU_Private_Variable group */

/* Private function prototypes -----------------------------------------------------------------------------*/

/** @defgroup CKCU_Private_Function_Prototype CKCU private function prototypes
  * @{
  */

/**
  * @}
  */  /* End of CKCU_Private_Function_Prototype group */

/* Private functions ---------------------------------------------------------------------------------------*/

/** @defgroup CKCU_Private_Function CKCU private functions
  * @{
  */

/*********************************************************************************************************//**
 * @brief  Deinitialize the CKCU registers to the reset values.

 * @retval None
 ************************************************************************************************************/
void CKCU_DeInit(void)
{
  /* Reset system clock */
  CKCU_HSICmd(ENABLE);
  while (CKCU_GetClockReadyStatus(CKCU_FLAG_HSIRDY) == RESET);
  CKCU_SysClockConfig(CKCU_SW_HSI);

  CKCU->AHBCFGR = 0x0;                          /* Reset value of AHBCFGR                                   */
  CKCU->MCUDBGCR = 0x0;                         /* Reset value of MCUDBGCR                                  */
  CKCU->APBCCR0 = 0x0;                          /* Reset value of APBCCR0                                   */
  CKCU->APBCCR1 = 0x0;                          /* Reset value of APBCCR1                                   */
  CKCU->APBCFGR = 0x0;                          /* Reset value of APBCFGR                                   */
  CKCU->AHBCCR = 0x5;                           /* Reset value of AHBCCR                                    */
  CKCU->GCFGR = 0x00000102;                     /* Reset value of GCFGR                                     */
  CKCU->GCIR = 0x0000007D;                      /* Clear interrupt flags                                    */
  CKCU->GCCR = 0x00000803;                      /* Reset value of GCCR                                      */
  CKCU->PLLCFGR = 0x0;                          /* Reset value of PLLCFGR                                   */
  CKCU->PLLCR = 0x0;                            /* Reset value of PLLCR                                     */
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the external high speed oscillator (HSE).
 * @note  HSE can not be stopped if it is used by system clock or PLL.
 * @param Cmd: new status of the HSE.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_HSECmd(EventStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BB_HSEEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the internal high speed oscillator (HSI).
 * @note  HSI can not be stopped if it is used by system clock or PLL.
 * @param Cmd: new status of the HSI.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_HSICmd(EventStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BB_HSIEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the PLL clock.
 * @note  PLL can not be stopped if it is used by system clock or USART.
 * @param Cmd: new status of PLL.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_PLLCmd(EventStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BB_PLLEN = Cmd;
}

/*********************************************************************************************************//**
 * @brief  Wait for HSE is ready to be used.

 * @retval An ErrStatus value:
 *         SUCCESS: HSE clock ready
 *         ERROR: HSE clock not ready yet
 ************************************************************************************************************/
ErrStatus CKCU_WaitHSEReady(void)
{
  vu32 ReadyCnt = 0;

  /* Wait until HSE is ready or time-out occurred                                                           */
  while (1)
  {
    if (CKCU_GetClockReadyStatus(CKCU_FLAG_HSERDY) == SET)
        break;

    ReadyCnt++;
    if (ReadyCnt >= HSE_READY_TIME)
        break;
  }

  if (CKCU_GetClockReadyStatus(CKCU_FLAG_HSERDY) == SET)
  {
    return SUCCESS;
  }
  else
  {
    return ERROR;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the specific clock ready flag is set or not.
 * @param CKCU_FLAG: specify the clock ready flag.
 *        This parameter can be:
 *        @arg CKCU_FLAG_PLLRDY : PLL ready flag.
 *        @arg CKCU_FLAG_HSERDY : HSE ready flag.
 *        @arg CKCU_FLAG_HSIRDY : HSI ready flag.
 *        @arg CKCU_FLAG_LSERDY : LSE ready flag.
 *        @arg CKCU_FLAG_LSIRDY : LSI ready flag.
 * @retval The status of CKCU_FLAG, SET or RESET.
 ************************************************************************************************************/
FlagStatus CKCU_GetClockReadyStatus(u32 CKCU_FLAG)
{
  FlagStatus RetValue = RESET;

  /* Check the parameters */
  Assert_Param(IS_CKCU_FLAG(CKCU_FLAG));

  if ( (CKCU->GCSR & CKCU_FLAG) != RESET )
  {
    RetValue = SET;
  }
  else
  {
    RetValue = RESET;
  }

  return RetValue;
}

/*********************************************************************************************************//**
 * @brief This function is used to configure PLL.
 * @param PLLInit: pointer to CKCU_PLLInitTypeDef structure that contains the configuration information
 *                 for PLL.
 * @retval None
 ************************************************************************************************************/
void CKCU_PLLInit(CKCU_PLLInitTypeDef *PLLInit)
{
  CKCU_BB_PLLSRC = PLLInit->ClockSource;
  CKCU->PLLCFGR = ((u32)PLLInit->CFG) << 16;
  CKCU_BB_PLLBYPASS = PLLInit->BYPASSCmd;
}

