Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_ckcu.c
/*********************************************************************************************************//**
 * @brief Configures the system clock (SYS_CK).
 *        This parameter can be:
 *        @arg CKCU_SW_PLL : PLL selected as system clock.
 *        @arg CKCU_SW_HSE : HSE selected as system clock.
 *        @arg CKCU_SW_HSI : HSI selected as system clock.
 * @retval None
 ************************************************************************************************************/
ErrStatus CKCU_SysClockConfig(CKCU_SW_TypeDef CLKSRC)
{
  u32 cnt = 0xFF;

  CKCU_BF_WRITE(CKCU->GCCR, CKCU_MASK_SW, CKCU_POS_SW, CLKSRC);

  /* Wait until system clock takes effect or time-out occurred */
  while (--cnt)
  {
    if (((CKCU->CKST >> 30) & CKCU_MASK_SW) == CLKSRC)
      break;
  }

  return ((cnt != 0)?(SUCCESS):(ERROR));
}

/*********************************************************************************************************//**
 * @brief  Return the source clock which is used as system clock.
 * @retval The source clock used as system clock.
 *         0x01: PLL selected as system clock
 *         0x02: HSE selected as system clock
 *         0x03: HSI selected as system clock
 ************************************************************************************************************/
u8 CKCU_GetSysClockSource(void)
{
  return ( (u8) CKCU_BF_READ(CKCU->GCCR, CKCU_MASK_SW, CKCU_POS_SW) );
}

/*********************************************************************************************************//**
 * @brief Configure the AHB clock (HCLK).
 * @param DIV: HCLK is derived from the system clock.
 *        This parameter can be:
 *        @arg CKCU_SYSCLK_DIV1: HCLK = SYS_CK
 *        @arg CKCU_SYSCLK_DIV2: HCLK = SYS_CK / 2
 *        @arg CKCU_SYSCLK_DIV4: HCLK = SYS_CK / 4
 *        @arg CKCU_SYSCLK_DIV8: HCLK = SYS_CK / 8
 * @retval None
 ************************************************************************************************************/
void CKCU_SetHCLKPrescaler(CKCU_SYSCLKDIV_TypeDef DIV)
{
  CKCU->AHBCFGR = DIV;
}

/*********************************************************************************************************//**
 * @brief Configure the USART divider.
 * @param URPRE: specify the value of divider.
 *        This parameter can be:
 *        @arg CKCU_URPRE_DIV1 : USART clock divided by 1.
 *        @arg CKCU_URPRE_DIV2 : USART clock divided by 2.
 * @retval None
 ************************************************************************************************************/
void CKCU_SetUSARTPrescaler(CKCU_URPRE_TypeDef URPRE)
{
  CKCU_BF_WRITE(CKCU->GCFGR, CKCU_MASK_URPRE, CKCU_POS_URPRE, URPRE);
}

/*********************************************************************************************************//**
 * @brief Configure the USB divider.
 * @param USBPRE: specifies the value of divider.
 *        This parameter can be:
 *        @arg CKCU_USBPRE_DIV1 : USB clock divided by 1.
 *        @arg CKCU_USBPRE_DIV2 : USB clock divided by 2.
 *        @arg CKCU_USBPRE_DIV3 : USB clock divided by 3.
 * @retval None
 ************************************************************************************************************/
void CKCU_SetUSBPrescaler(CKCU_USBPRE_TypeDef USBPRE)
{
  CKCU_BF_WRITE(CKCU->GCFGR, CKCU_MASK_USBPRE, CKCU_POS_USBPRE, USBPRE);
}

/*********************************************************************************************************//**
 * @brief Configure the ADC clock divider.
 * @param PCLK_DIVX: ADC clock is derived from the PCLK.
 *        This parameter can be:
 *        @arg CKCU_PCLK_DIV2   : ADC_CK = PCLK / 2.
 *        @arg CKCU_PCLK_DIV4   : ADC_CK = PCLK / 4.
 *        @arg CKCU_PCLK_DIV6   : ADC_CK = PCLK / 6.
 *        @arg CKCU_PCLK_DIV8   : ADC_CK = PCLK / 8.
 *        @arg CKCU_PCLK_DIV16  : ADC_CK = PCLK / 16.
 *        @arg CKCU_PCLK_DIV32  : ADC_CK = PCLK / 32.
 *        @arg CKCU_PCLK_DIV64  : ADC_CK = PCLK / 64.
 * @retval None
 ************************************************************************************************************/
void CKCU_SetADCPrescaler(CKCU_PCLKDIV_TypeDef PCLK_DIVX)
{
  CKCU_BF_WRITE(CKCU->APBCFGR, CKCU_MASK_ADCDIV, CKCU_POS_ADCDIV, PCLK_DIVX);
}

/*********************************************************************************************************//**
 * @brief Configure the WDT clock source (WDT_CK).
 * @param SRC: specify the WDT clock source.
 *        This parameter can be:
 *        @arg CKCU_WDTSRC_LSI : LSI_CK selected as WDT clock
 *        @arg CKCU_WDTSRC_LSE : LSE_CK selected as WDT clock
 * @retval None
 ************************************************************************************************************/
void CKCU_WDTSourceConfig(CKCU_WDTSRC_TypeDef SRC)
{
  CKCU_BB_WDTSRC = SRC;
}

/*********************************************************************************************************//**
 * @brief Return the frequency of the different clocks.
 * @param CKCU_Clk: pointer to CKCU_ClocksTypeDef structure to get the clocks frequency.
 * @retval None
 ************************************************************************************************************/
void CKCU_GetClocksFrequency(CKCU_ClocksTypeDef* CKCU_Clk)
{
  u32 pllNO, pllNF;
  u32 sw, urpre, div;

  /* Get PLL frequency                                                                                      */
  if (CKCU_BB_PLLEN == DISABLE)
  {
    CKCU_Clk->PLL_Freq = 0;
  }
  else
  {
    if (CKCU_BB_PLLBYPASS != DISABLE)
    {
      if (CKCU_BB_PLLSRC == CKCU_PLLSRC_HSE)
      {
        CKCU_Clk->PLL_Freq = HSE_VALUE;
      }
      else
      {
        CKCU_Clk->PLL_Freq = HSI_VALUE;
      }
    }
    else
    {
      pllNF = CKCU_BF_READ(CKCU->PLLCFGR, CKCU_MASK_PLLFBDV, CKCU_POS_PFBD);
      if(pllNF == 0)
        pllNF=64;

      pllNO = CKCU_BF_READ(CKCU->PLLCFGR, CKCU_MASK_PLLOTDV, CKCU_POS_POTD);
      pllNO = (u8)0x1 << pllNO;

      if (CKCU_BB_PLLSRC == CKCU_PLLSRC_HSE)
      {
        CKCU_Clk->PLL_Freq = (HSE_VALUE / pllNO) * pllNF;
      }
      else
      {
        CKCU_Clk->PLL_Freq = (HSI_VALUE / pllNO) * pllNF;
      }
    }
  }

