Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_ckcu.c
/*********************************************************************************************************//**
 * @brief Clear the CKCU interrupt flag.
 * @param CKCU_INT: specify the CKCU interrupt flag to clear.
 *        This parameter can be:
 *        @arg CKCU_INT_CKS   : HSE clock failure interrupt (NMI) flag
 *        @arg CKCU_INT_PLLRDY: PLL ready interrupt flag
 *        @arg CKCU_INT_HSERDY: HSE ready interrupt flag
 *        @arg CKCU_INT_HSIRDY: HSI ready interrupt flag
 *        @arg CKCU_INT_LSERDY: LSE ready interrupt flag
 *        @arg CKCU_INT_LSIRDY: LSI ready interrupt flag
 * @retval None
 ************************************************************************************************************/
void CKCU_ClearIntFlag(u8 CKCU_INT)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_INT_FLAG(CKCU_INT));

  CKCU->GCIR |= CKCU_INT;
}

/*********************************************************************************************************//**
 * @brief Enables or Disable the specific CKCU interrupts.
 * @param CKCU_INT: specify the CKCU interrupt source which is enabled or disabled.
 *        This parameter can be:
 *        @arg CKCU_INT_CKSIE    : HSE clock failure interrupt (NMI)
 *        @arg CKCU_INT_PLLRDYIE : PLL ready interrupt
 *        @arg CKCU_INT_HSERDYIE : HSE ready interrupt
 *        @arg CKCU_INT_HSIRDYIE : HSI ready interrupt
 *        @arg CKCU_INT_LSERDYIE : LSE ready interrupt
 *        @arg CKCU_INT_LSIRDYIE : LSI ready interrupt
 * @param Cmd: new status of the specific CKCU interrupts.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_IntConfig(u32 CKCU_INT, ControlStatus Cmd)
{
  u32 tmp1;

  /* Check the parameters */
  Assert_Param(IS_CKCU_INT(CKCU_INT));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  tmp1 = CKCU->GCIR;
  if (Cmd != DISABLE)
  {
    tmp1 |= CKCU_INT;
  }
  else
  {
    tmp1 &= ~CKCU_INT;
  }

  /* Note: CKCU interrupt flags will be cleared by writing "1". */
  tmp1 &= ~0x0000007D;
  CKCU->GCIR = tmp1;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable SRAM/FMC clock during Sleep mode.
 * @param CKCU_CLK: specify the clock which is enabled or disabled.
 *        This parameter can be:
 *        @arg CKCU_AHBEN_SLEEP_FMC
 *        @arg CKCU_AHBEN_SLEEP_SRAM
 * @param Cmd: new status of the specific clocks.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_SleepClockConfig(u32 CKCU_CLK, ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_SLEEP_AHB(CKCU_CLK));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  if (Cmd == ENABLE)
  {
    CKCU->AHBCCR |= CKCU_CLK;
  }
  else
  {
    CKCU->AHBCCR &= ~CKCU_CLK;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the AHB peripheral clock.
 * @param CKCU_CLK: specifies the clock which is enabled or disabled.
 *        This parameter can be:
 *        @arg CKCU_AHBEN_PDMA
 *        @arg CKCU_AHBEN_CSIF
 *        @arg CKCU_AHBEN_CSIFM
 * @param Cmd: new status of the specific clocks.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_AHBPeripClockConfig(u32 CKCU_CLK, ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_AHBEN(CKCU_CLK));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  if (Cmd == ENABLE)
  {
    CKCU->AHBCCR |= CKCU_CLK;
  }
  else
  {
    CKCU->AHBCCR &= ~CKCU_CLK;
  }
}

/*********************************************************************************************************//**
 * @brief Check if PLL clock used by the specific target source or not.
 * @param Target: specifies the target clock.
 *        This parameter can be:
 *        @arg CKCU_PLLST_SYSCK : Is PLL used by system clock
 *        @arg CKCU_PLLST_USB   : Is PLL used by USB
 *        @arg CKCU_PLLST_CSIF  : Is PLL used by CSIF
 * @retval The status of target clock, TRUE or FALSE.
 ************************************************************************************************************/
bool CKCU_IS_PLL_USED(CKCU_PLLST_TypeDef Target)
{
  u32 temp;

  temp = (CKCU->CKST >> 8) & ((u32)Target);
  if (temp != FALSE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/*********************************************************************************************************//**
 * @brief Check HSI clock used by the specific target source or not.
 * @param Target: specify the target clock.
 *        This parameter can be:
 *        @arg CKCU_HSIST_SYSCK: Is HSI used by system clock
 *        @arg CKCU_HSIST_PLL  : Is HSI used by PLL
 *        @arg CKCU_HSIST_CKM  : Is HSI used by clock monitor
 * @retval The status of target clock, TRUE or FALSE.
 ************************************************************************************************************/
bool CKCU_IS_HSI_USED(CKCU_HSIST_TypeDef Target)
{
  u32 temp;

  temp = (CKCU->CKST >> 24) & ((u32)Target);
  if (temp != FALSE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

/*********************************************************************************************************//**
 * @brief Check HSE clock used by the specific target source or not.
 * @param Target: specify the target clock.
 *        This parameter can be:
 *        @arg CKCU_HSEST_SYSCK : Is HSE used by system clock
 *        @arg CKCU_HSEST_PLL   : Is HSE used by PLL
 * @retval The status of target clock, TRUE or FALSE.
 ************************************************************************************************************/
bool CKCU_IS_HSE_USED(CKCU_HSEST_TypeDef Target)
{
  u32 temp;

  temp = (CKCU->CKST >> 16) & (u32)Target;
  if (temp != FALSE)
  {
    return TRUE;
  }
  else
  {
    return FALSE;
  }
}

