Ernest4CU/Wlight/library/HT32F175x_275x_Driver/src/ht32f175x_275x_ckcu.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the specific debug function.
 * @param CKCU_DBGx: specify the debug functions to be enabled or disabled.
 *        This parameter can be:
 *        @arg CKCU_DBG_SLEEP         , CKCU_DBG_DEEPSLEEP1
 *             CKCU_DBG_POWERDOWN     , CKCU_DBG_DEEPSLEEP2
 *             CKCU_DBG_WDT_HALT      , CKCU_DBG_MCTM_HALT
 *             CKCU_DBG_GPTM0_HALT    , CKCU_DBG_GPTM1_HALT
 *             CKCU_DBG_USART0_HALT   , CKCU_DBG_USART1_HALT
 *             CKCU_DBG_SPI0_HALT     , CKCU_DBG_SPI1_HALT
 *             CKCU_DBG_I2C0_HALT     , CKCU_DBG_I2C1_HALT
 *             CKCU_DBG_SCI_HALT      , CKCU_DBG_BFTM0_HALT
 *             CKCU_DBG_BFTM1_HALT
 * @param Cmd: new status of the debug functions.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_MCUDBGConfig(u16 CKCU_DBGx, ControlStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CKCU_DBG(CKCU_DBGx));
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  if (Cmd != DISABLE)
  {
    CKCU->MCUDBGCR |= (u32)CKCU_DBGx;
  }
  else
  {
    CKCU->MCUDBGCR &= ~((u32)CKCU_DBGx);
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the Backup domain isolation control.
 * @param Cmd: new status of isolation control.
 *        This parameter can be:
 *        @arg ENABLE
 *        @arg DISABLE
 * @retval None
 ************************************************************************************************************/
void CKCU_BKISOCmd(EventStatus Cmd)
{
  /* Check the parameters */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  if (Cmd == DISABLE)
  {
    CKCU_BB_BKISO = 1;  /* Backup domain is accessible by other power domain */
  }
  else
  {
    CKCU_BB_BKISO = 0;  /* Backup domain is isolated from other power domain */
  }
}

/**
  * @}
  */  /* End of CKCU_Private_Function group */

/**
  * @}
  */  /* End of CKCU peripheral group */

/**
  * @}
  */  /* End of HT32F175x_275x_Peripheral_Driver group */
